import { ProjectCardProps } from 'components/card-table/types';

export const CardTableData = [
  {
    title: {
      id: '768873',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
] as ProjectCardProps[];
export const CardTableDataPrevious = [
  {
    title: {
      id: '768873',
      inquiryStatus: 'canceled',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
      inquiryStatus: 'completed',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
      inquiryStatus: 'pending',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
      inquiryStatus: 'completed',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
      inquiryStatus: 'completed',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
      inquiryStatus: 'completed',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
      inquiryStatus: 'pending',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
      inquiryStatus: 'pending',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
      inquiryStatus: 'pending',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
      inquiryStatus: 'pending',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
      inquiryStatus: 'completed',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
      inquiryStatus: 'completed',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
      inquiryStatus: 'canceled',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
      inquiryStatus: 'completed',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
      inquiryStatus: 'pending',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
  {
    title: {
      id: '768873',
      inquiryStatus: 'completed',
    },
    content: {
      projectName: 'مشروع صيانة جامع جمعية الدعوة الصناعية الجديدة بالرياض',
      createdAt: new Date(2022, 8, 2, 15, 58),
      projectStatus: 'في انتظار موافقة',
      projectDetails:
        'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو........',
    },
    footer: {
      createdAt: new Date(2022, 8, 2, 15, 58),
    },
  },
] as ProjectCardProps[];
